In [1]:
!pip install pandasql

Requirement already satisfied: pandasql in c:\users\oldva\anaconda3\lib\site-packages (0.7.3)
Requirement already satisfied: pandas in c:\users\oldva\anaconda3\lib\site-packages (from pandasql) (1.4.2)
Requirement already satisfied: numpy in c:\users\oldva\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: sqlalchemy in c:\users\oldva\anaconda3\lib\site-packages (from pandasql) (1.4.32)
Requirement already satisfied: pytz>=2020.1 in c:\users\oldva\anaconda3\lib\site-packages (from pandas->pandasql) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\oldva\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\oldva\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\oldva\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)

In [2]:
import pandas as pd
import pandasql
import sqlite3

1)Опишите имеющиеся колонки в данных - сделайте аналог describe в pandas для колонок.

In [3]:
hypothec = pd.read_excel('skill/data/bank_account_data.xlsx')
display(hypothec.head())

   Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age       Date
0        1         0   1739.48  26918.18  12563.93           0   49        NaT
1        2         0   2862.35  23093.67  15457.88           0   39        NaT
2        3         0   2296.66  18037.33  12721.89           0   52        NaT
3        4         1   2880.28  32317.63   7075.03           0   28 2017-04-30
4        5         0    998.27  15110.04  11356.13           0   43        NaT

In [4]:
sub_data = pandasql.sqldf("SELECT * FROM hypothec")
print(sub_data)

     Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age  \
0          1         0   1739.48  26918.18  12563.93           0   49
1          2         0   2862.35  23093.67  15457.88           0   39
2          3         0   2296.66  18037.33  12721.89           0   52
3          4         1   2880.28  32317.63   7075.03           0   28
4          5         0    998.27  15110.04  11356.13           0   43
..       ...       ...       ...       ...       ...         ...  ...
195      196         0   2215.39  20050.87  11307.01           0   32
196      197         0   2074.33  22808.68   7880.16           0   27
197      198         0   1224.07  29926.97   5637.92           0   44
198      199         0   2617.27  14316.61   9445.28           0   38
199      200         0   2125.45  25687.52   4559.63           0   56

                           Date
0                          None
1                          None
2                          None
3    2017-04-30 00:00:00.000000
4                          None
..                          ...
195                        None
196                        None
197                        None
198                        None
199                        None

[200 rows x 8 columns]

In [5]:
data_1 = pandasql.sqldf("SELECT\
    COUNT(*) count,\
    AVG(Cheq_Bal) AS avg_Cheq_Bal, AVG(Sav_Bal) AS avg_Sav_Bal, AVG(Debt_Bal) AS avg_Debt_Bal,\
    MAX(Cheq_Bal) AS max_Cheq_Bal, MAX(Sav_Bal) AS max_Sav_Bal, MAX(Debt_Bal) AS max_Debt_Bal,\
    MIN(Cheq_Bal) AS min_Cheq_Bal, MIN(Sav_Bal) AS min_Sav_Bal, MIN(Debt_Bal) AS min_Debt_Bal\
    FROM hypothec")
print(data_1)

   count  avg_Cheq_Bal  avg_Sav_Bal  avg_Debt_Bal  max_Cheq_Bal  max_Sav_Bal  \
0    200     2145.0935  22084.42895     8638.3696       4437.44     39132.63

   max_Debt_Bal  min_Cheq_Bal  min_Sav_Bal  min_Debt_Bal
0       20559.7        644.31      6558.91           0.0

2) Посчитайте совокупный объем средств у клиентов в банке - сумма по всем балансам.

In [6]:
data_2 = pandasql.sqldf("SELECT\
    SUM(Cheq_Bal + Sav_Bal + Debt_Bal) 'совокупный объем средств у клиентов в банке'\
    FROM hypothec")
print(data_2)

   совокупный объем средств у клиентов в банке
0                                   6573578.41

3) Выведите только тех клиентов, которые приобрели ипотеку (колонка mortgage).

In [10]:
data_3 = pandasql.sqldf("SELECT\
    Cust_ID AS mortgage\
    FROM hypothec\
    WHERE Purchase == 1")
print(data_3)

    mortgage
0          4
1          6
2          7
3         11
4         13
5         17
6         18
7         20
8         22
9         31
10        36
11        38
12        40
13        41
14        54
15        56
16        59
17        60
18        74
19        76
20        80
21        87
22        91
23        93
24        94
25        97
26       100
27       107
28       111
29       113
30       132
31       146
32       154
33       166
34       169
35       182
36       184
37       185
38       189

4) Какой совокупный объем средств в среднем у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [11]:
data_4 = pandasql.sqldf("SELECT\
    SUM(Cheq_Bal + Sav_Bal + Debt_Bal) 'совокупный объем средств у клиентов в банке'\
    FROM hypothec\
    GROUP BY Purchase")
print(data_4)

   совокупный объем средств у клиентов в банке
0                                   5167437.49
1                                   1406140.92

5) Есть ли разница в среднем по каждому из типов баланса у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [12]:
data_5 = pandasql.sqldf("SELECT\
    AVG(Cheq_Bal) Cheq_Bal_avg,\
    AVG(Sav_Bal) Sav_Bal_avg,\
    AVG(Debt_Bal) Debt_Bal_avg\
    FROM hypothec\
    GROUP BY Purchase")
print(data_5)

   Cheq_Bal_avg   Sav_Bal_avg  Debt_Bal_avg
0   1996.631366  20257.209814   9842.043851
1   2757.975641  29627.564359   3669.355385

6) Выберите самого возрастного получателя ипотеки.

In [13]:
data_6 = pandasql.sqldf("SELECT *\
    FROM hypothec\
    WHERE Purchase == 1\
    ORDER BY Age DESC\
    LIMIT 1")
print(data_6)

   Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age  \
0       41         1    3615.8  24983.76   5663.16           0   45

                         Date
0  2017-08-25 00:00:00.000000

7) Выберите клиента, который раньше всех получил ипотеку.

In [14]:
data_7 = pandasql.sqldf("SELECT *\
    FROM hypothec\
    WHERE Date IS NOT NULL\
    AND Purchase == 1\
    ORDER BY Date\
    LIMIT 1")
print(data_7)

   Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age  \
0      185         1   1759.04  29198.17   3285.39           1   36

                         Date
0  2017-04-01 00:00:00.000000

8) Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)

In [15]:
conn = sqlite3.connect('test.db')

conn.execute('''
CREATE TABLE pokemon ( id INTEGER, 
name STRING, 
type STRING, 
hp INTEGER, 
rating REAL );''')

conn.commit()

conn.close()

9) Добавьте 3 полностью заполненные строки в вашу БД.

In [16]:
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO pokemon VALUES ('1', 'Bulbasaur', 'Grass', '45', '10.0');")
conn.execute("INSERT INTO pokemon VALUES ('5', 'Charmander', 'Fire', '39', '9.5');")
conn.execute("INSERT INTO pokemon VALUES ('10', 'Squirtle', 'Water', '44', '8.5');")
conn.commit()
conn.close()

In [17]:
conn = sqlite3.connect('test.db')
cur = conn.cursor()
cur.execute("SELECT * from pokemon;")

result = cur.fetchall()
conn.close()

In [18]:
result

[(1, 'Bulbasaur', 'Grass', 45, 10.0),
 (5, 'Charmander', 'Fire', 39, 9.5),
 (10, 'Squirtle', 'Water', 44, 8.5)]

10) Удалите строку из колонки типа REAL (из пункта 8), в которой значение признака среднее (то есть не минимальное и не максимальное). Напрямую указывать значение из этой строки нельзя.

In [19]:
conn = sqlite3.connect('test.db')
cur = conn.cursor()
cur.execute("SELECT * from pokemon ORDER BY rating Limit 1, 1;")
de = cur.fetchall()
conn.close()

In [20]:
conn = sqlite3.connect('test.db')
sql_del = "DELETE FROM pokemon where id = "
conn.execute(sql_del + str(de[0][0]))

conn.commit()
conn.close()

In [21]:
conn = sqlite3.connect('test.db')
cur = conn.cursor()
cur.execute("SELECT * from pokemon;")

result = cur.fetchall()
conn.close()

In [22]:
result

[(1, 'Bulbasaur', 'Grass', 45, 10.0), (10, 'Squirtle', 'Water', 44, 8.5)]